[
    {
        "Review": "Super light, as the name suggests lol. Great mouse. Feels great in hand and the latency is really good for a wireless mouse. Can't tell the difference to my older wired one that I was using previously (Razer Viper Mini). Overall great mouse and if you can get this thing on sale, I'd definitely say to buy it! Nice to use for productivity and of course for gaming as well. Good charge so far and no complaints! Nice job Logitech.",
        "True Sentiment": "Positive"
    },
    {
        "Review": "I absolutely love this mouse! The RGB lighting is gorgeous, and it's so smooth to use for gaming.",
        "True Sentiment": "Positive"
    },
    {
        "Review": "The mouse is okay. The buttons feel a little cheap, but it works fine for the most part.",
        "True Sentiment": "Neutral"
    },
    {
        "Review": "This is awful! The left click broke after just a week. Completely unacceptable for this price.",
        "True Sentiment": "Negative"
    },
    {
        "Review": "I can't imagine gaming without this mouse now. The precision and response are top-notch!",
        "True Sentiment": "Positive"
    },
    {
        "Review": "It's just a basic mouse. Does what it's supposed to, but nothing to write home about.",
        "True Sentiment": "Neutral"
    },
    {
        "Review": "This was such a waste of money. The sensor skips constantly, and I can't use it for gaming at all.",
        "True Sentiment": "Negative"
    },
    {
        "Review": "The build quality is excellent, and it fits perfectly in my hand. Great for long gaming sessions.",
        "True Sentiment": "Positive"
    },
    {
        "Review": "Honestly, the mouse feels cheap, and the scroll wheel already started wobbling after two weeks.",
        "True Sentiment": "Negative"
    },
    {
        "Review": "It's fine for casual use, but don't expect it to handle competitive gaming well.",
        "True Sentiment": "Neutral"
    },
    {
        "Review": "The customizable buttons make it perfect for MMOs. I love how easy it is to set up profiles.",
        "True Sentiment": "Positive"
    },
    {
        "Review": "Terrible customer service! My mouse arrived broken, and they refused to help me at all.",
        "True Sentiment": "Negative"
    },
    {
        "Review": "This mouse is so lightweight and precise. It's perfect for fast-paced FPS games!",
        "True Sentiment": "Positive"
    },
    {
        "Review": "The mouse works fine, but the software is a pain to use. I wish it were more user-friendly.",
        "True Sentiment": "Neutral"
    },
    {
        "Review": "Awful product. It stopped working completely after just a month, and support has been useless.",
        "True Sentiment": "Negative"
    },
    {
        "Review": "I love that I can switch DPI settings on the fly. Makes it super versatile for different games.",
        "True Sentiment": "Positive"
    },
    {
        "Review": "It looks cool with the RGB lighting, but it's not comfortable for people with smaller hands.",
        "True Sentiment": "Neutral"
    },
    {
        "Review": "This is by far the worst gaming mouse I've ever owned. The build quality is terrible.",
        "True Sentiment": "Negative"
    },
    {
        "Review": "Amazing tracking and smooth gliding. It's perfect for both gaming and productivity.",
        "True Sentiment": "Positive"
    },
    {
        "Review": "The RGB lights are nice, but the performance doesn't justify the price. Just average overall.",
        "True Sentiment": "Neutral"
    },
    {
        "Review": "I can't believe how bad this mouse is. It stopped working after three weeks. Total junk!",
        "True Sentiment": "Negative"
    },
    {
        "Review": "Best mouse I’ve ever had! The responsiveness is insane, and it’s so comfortable for long sessions.",
        "True Sentiment": "Positive"
    },
    {
        "Review": "The price is too high for what you’re getting. It’s not bad, but definitely not worth it.",
        "True Sentiment": "Neutral"
    },
    {
        "Review": "Horrible experience. The side buttons fell off after just two days of use. Never buying from this brand again.",
        "True Sentiment": "Negative"
    },
    {
        "Review": "Great mouse for the price. It’s not perfect, but it gets the job done for gaming and work.",
        "True Sentiment": "Positive"
    },
    {
        "Review": "The sensor skips sometimes, which makes it annoying for precise gaming, but it's decent otherwise.",
        "True Sentiment": "Neutral"
    },
    {
        "Review": "Terrible design. The shape is uncomfortable, and my hand hurts after 30 minutes of use.",
        "True Sentiment": "Negative"
    },
    {
        "Review": "Solid mouse with excellent build quality. The clicks feel satisfying, and the tracking is accurate.",
        "True Sentiment": "Positive"
    },
    {
        "Review": "It’s just okay. Nothing stands out, but it does what it’s supposed to do.",
        "True Sentiment": "Neutral"
    },
    {
        "Review": "The worst purchase I’ve made in years. The mouse is completely unusable.",
        "True Sentiment": "Negative"
    }
]
