[
    {
        "Date": "Reviewed in the United States on July 29, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "This mouse is replacing an older wired mouse that I really liked, but after two of those old ones failed within a year, I figured I'd pull the trigger on this one.  I was not disappointed.  It feels good in the hand, has a great DPI adjustment, and ALL the buttons are programmable (including the stock DPI settings button by the scroll wheel).  The included weight disk to put in the bottom is a nice feature, too.  I like a heavier mouse.I leave the \"bling\" (the RGB lights) turned off to extend battery life between charges, and it lasts me days without getting low doing it that way.  If you MUST have the RGB switched on, it will drain the battery faster, but it comes with a handy charger/dongle adapter which you could even use as a wired mouse if you really wanted to.  All in all, one of the better mice Logitech has made in recent years.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on August 17, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "I originally purchased a G305 Mouse.  It replaces the Microsoft 4000 mouse that I had been purchasing for years.  The G305 had a bad dongle, so I purchased the G703 as a replacement.The G703 is a great mouse.  I like where the charging port it and the guides it uses to secure the cable to the mouse.  So far I have been charging it once a week and have never run out of battery power.  If you download the G Hub app, it will let you know the battery level and charging progress.  It's pretty much required if you like a higher sensitivity for your mouse setting.The one beef....  Logitech... could you have a socket for the dongle to be placed in.  I travel a lot and take it with me.  I am always worried about loosing the dongle.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on December 18, 2021",
        "Rating": "5.0 out of 5 stars",
        "Review": "UPDTAE: JAN 6, 2022. ive had this mouse for a month now and till now I have 0 double clicking issues. I use a double click detector on google site, everyday since I've got this mouse I test 200 clicks on left and right click. I get 0 double clicks error.Also the logitech software on PC has been updated and I have 0 issues with it as mentioned on some of the reviews on here. Also the range and disconnecting issue I have not encountered them ( PRO TIP: USE the cable extension that it came with as this acts as an antenna extender and place the USB dongle away from your PC, metal, or any electronics that can cause interference. Also make sure to separate from other wireless dongles IE: Logitech G915 Wreless).As for its size and ergonomics, it is very comfortable to use.  I have very small hands and it's comfortable for me. It's works great for palm gripper of ypu have small hands.Old review:I was very skeptical about purchasing this but It's been 3 weeks and NO double click issue that people are reporting on other reviews. Very light and premium build. It uses the same Hero sensor as the more expensive G pro  for a lot cheaper price. It's ergonomic and it's perfect for palm grip. Other grip style works well IF YOU HAVE BIG HANDS. For smaller hands palm grip works well. RGB is nice without over doing it. The material they use are premium and there is rubber pad grips on the sides to help slippage. The left/right and side button clicks are one of the best feeling in the market. The wheel scroll is also very good. Unfortunately there is no infinite scroll but it's NOT deal breaker what so ever. ONE of the best gaming mouse I've used and it's very sleek looking. Other gaming mouse looks over done with a transformer look to it, which I hate. Lots of good review on YT",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on August 19, 2024",
        "Rating": "4.0 out of 5 stars",
        "Review": "This is a review for the Logitech G703 wireless mouse. I have had two in a three year time span.I am generally a fan of this mouse.I won't speak to the shape of it too much because that is very subjective per each individual. I will note, though this may be obvious, that the G703 is definitely designed to be a right-handed mouse. I personally find it ergonomic to use - I am right-handed, hand size is 10cm wide by 17cm long, and use this mouse mostly in a claw grip.The long-standing gripe with the G703 is that the scroll wheel tends to flake out, and my first purchase of the G703 was no exception to this. For me, the scroll wheel issues started to occur three years after purchase. The issue is that the scroll wheel would sort of chatter and spaz out on screen - the physical scroll wheel works fine mechanically, but the scroll wheel input is wildly inconsistent. For example, if you scroll down the same exact way three times, you may scroll down normally on the PC the first time, then the second time it actually scrolls up (even though you physically scrolled down) and the third time it will scroll down but at a very different rate than before.I worked with customer service to diagnose the issue and they could not find a mechanical problem. I eventually took the mouse apart and can confirm that there is no mechanically broken component or debris in the mouse to cause this at a mechanical level - there is likely something wrong with the actual electric or software components of the mouse.Other than that one big, glaring issue, I really like this mouse! I use it mostly for office work and internet browsing, though I have also used it for gaming. I am not a pro FPS player and cannot comment on the super fine details like latency and pixel/DPS accuracy, but I use this mostly on wireless and see 0 issues on my end.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on January 3, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "I'm a huge FPS fan, and let me tell you, the Logitech G703 has been a game-changer (pun intended!). This wireless mouse is seriously smooth, with the Hero 25K sensor making my aim feel laser-precise. No more jitters or lag, even during those intense clutch moments. Plus, it's super lightweight, so I can flick it around the mousepad like nobody's business.Speaking of clutch moments, I remember one round in Valorant where everything came down to the wire. We were planting the bomb on B site, and the last enemy was lurking somewhere. My heart was pounding, but thanks to the G703's pinpoint accuracy, I was able to track him down through the smoke and secure the win. My teammates were going crazy!Overall, the G703 is an absolute beast for any gamer who takes their performance seriously. It's comfortable, responsive, and packed with features that make a real difference in the heat of the battle. If you're looking for a wireless mouse that won't let you down, look no further.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on June 3, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "Third G703 over 5+ years. First one's scroll wheel broke after a few months. Got a replacement through Logitech warranty (no issues), and have been using that one since then. Just recently the left click started to not be consistent. Probably just worn out. Only difference I can feel with the new G703 is the scroll wheel is more distinct, which is a huge plus for me. Obviously, it has the upgraded sensor, but everything else feels exactly the same. I just wish they made a larger version. This thing is tiny.I only use 400 and 800 DPI (400 for games, 800 for desktop), and I use on-board memory and turn all the lights off to maximize battery life. This makes the application a one time use then uninstall sort of thing once I've set the mouse up (which I really like. I don't like having to have other applications running, especially for something like my mouse).",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on June 5, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "Mice shape are of course personal preference but I think this has one of the more comfortable shapes and wireless is the only way I will be able to use a mouse. Do yourself a favor and get this mouse because it has usb charging instead of a battery (it takes very little to charge and use for a long time).It has Logitech g hub program available which allows for more customizations. There’s not much else I would want from this product myself.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on October 22, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "The Logitech G703 Lightspeed is hands down the best mouse I’ve used. I keep it plugged into my PC most of the time, but when I feel like going wireless, I just unplug it from the mouse, and it’s ready to go—smooth and effortless. The lightweight design feels great, even during long gaming sessions, and the customizable buttons with G Hub software are a game-changer. You can set up macros and remap everything to fit your needs. Whether you want it wired or wireless, this mouse delivers on every front. Highly recommend!",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on November 15, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "On one of my Corsairs (Harpoon RGB) the sensor died, and I had to urgently choose another mouse with a similar shape. To be honest, in general, my experience with Logitech is not very good, but this mouse is the closest and most comfortable after the Corsair, which has a fairly high back. So, perfect mouse",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on May 24, 2023",
        "Rating": "3.0 out of 5 stars",
        "Review": "Complete Old Logitech G703Before I purchased this mouse, I was using an old version of Logitech G703, which has PMW3366 sensor inside it.The package arrived without any physical or cosmetic damage, but the same can't be said about mouse. The mouse's feet/skates looked like somebody took the mouse for a test drive before putting it back inside a box. The sides of the scroll wheel looked shabby, as if somebody was scratching them with long nails.The software support of the new and the old versions are like night and day. The new version works only with infamous G Hub software, while the old version can work with either G Hub or Logitech Gaming software. While both software programs are horrible and unnecessary in their own unique ways, The Gaming software lets you at least turn off LEDs. That is right; G Hub does not have an option of turning off LEDs on the wireless mouse, which has a limited battery life. The only way to do that is through on board memory configurator, which is like a small .exe file, which lets you configure your mouse without installing any kind of manufacturers’ software/bloatware. Another good point in Gaming software is that it has a notification for when the battery drops to 30 percent of battery life, which is quite useful for prolonging the battery’s factory lifespan. G Hub has that too, but for some reason, it malfunctions from time to time. The only thing I would have added is an option of stopping the charging process when the battery gets to a certain number of percent.The weight reduction in the new version is almost similar to an old version. Since I lightly modified the whole case of my old G703 to honeycomb style and got it to eight five grams, personally, I do not feel any significant difference between almost hundred eight and almost ninety eight grams. From my point of view, there are many unnecessary parts inside the case of the mouse, which can be easily removed for a smoother and lighter feel. The main weight reduction in the new version is not only from a smaller battery, but also from a smaller/thinner PCB. The old PCB’s weight is around fourteen-fifteen grams, while the new PCB is somewhere between ten-eleven grams.As with an old version, both side buttons and front buttons have a palpable free space between the micro switch and buttons’ plastic hump, which touches the stem of the switch. Because of that, there is a potential increase in latency. After I replaced Chinese Omron micro switches to TTC gold micro switches in the old version, the space between the micro switch and buttons’ plastic hump is almost non-existent. Perhaps the solution to this issue are micro switches with either longer stems or bigger case height than on Chinese Omron switches.The sensor itself works as great as the old PMW3366. I did not notice any lags/jitters while I was using it in four different competitive FPS titles. The only difference is that it is less power hungry than PMW3366.The new version of G703 was released in 2019, but for some reason, Logitech still uses USB micro B port instead of USB type C to this day. It feels like Logitech purchased several trucks full of these USB micro B ports and since the money was already spent, they just need to use them until they are completely gone.The battery life is much better than the old version. I use the mouse without any LEDs, on three thousand two hundred DPI and on thousand Hertz polling rate for four to six hours a day. I try to charge the battery to eighty percent whenever it drops to thirty percent. The seven hundred fifty mAh battery in the old version needs to be recharged every third day, while the two hundred forty mAh battery in the new version stays strong for almost two weeks without any charge.Overall, the shape of the mouse and the mouse itself are great, but it feels like this version is what the old G703 was supposed to be. I hope that Logitech either release the better version of G703 or a better variation of an ergonomic mouse.",
        "Sentiment Label": "Negative"
    },
    {
        "Date": "Reviewed in the United States on November 19, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "Great mouse very comfortable",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on October 11, 2024",
        "Rating": "4.0 out of 5 stars",
        "Review": "The mouse has an and average weight that makes it easy to adjust to. I didn’t find that the optional weight made much of a difference, but it’s still worth a try. The feel in you hand is very comfortable and also easy to adjust to.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on September 22, 2024",
        "Rating": "4.0 out of 5 stars",
        "Review": "This is a great gaming mouse and my son wanted it to use with his iPad. It works well but I wish I would have done further research on what I was buying. it isn't actually bluetooth and the only way it connects to your iPad or computer is by being plugged directly into that device. Meaning that he cannot charge his iPad while also using the mouse. Otherwise it works great and has absolutely no lag time.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on September 6, 2024",
        "Rating": "4.0 out of 5 stars",
        "Review": "It is a great mouse other than the lack of horizontal scrolling.  Most of the other mice I have used that had a scroll wheel also did horizontal scrolling.  Not this mouse.  If that is not an issue for you, I strongly recommend this mouse.For a lightweight rechargeable mouse, the interval between charges is great.  I seem to be getting at least two weeks between charges.  And it can still be used normally while it is plugged in and charging.  Charging seems quick.  I think it took just over an hour while I was using it.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on September 25, 2024",
        "Rating": "4.0 out of 5 stars",
        "Review": "The shape and weight of the mouse are great, i switched from Razer essential and they have similar builds. HOWEVER, the cord on this mouse is bad. i feel the drag when playing corded, and it gets stuck on everything. It would have been such an upgrade if it was braided and could actually bend with freewill",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on August 28, 2024",
        "Rating": "4.0 out of 5 stars",
        "Review": "This is a great gaming mouse.  The scroll wheel tends to get finicky after a year, but is remedied fairly easy by disassembling and cleaning.  I found a video online that covered the process.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on July 7, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "Don’t get me wrong - this mouse works great and has no issues with quality or wireless connectivity. My problem with the mouse, however, was the size. Lengthwise, it’s fine, but the mouse was quite a bit skinnier than the Razer Deathadder I was used to. I ended up returning this and buying a wireless Deathadder. I recommend anyone that owns a wider mouse to do some measurements beforehand as this mouse was quickly cramping my hands during gaming.The only other issue I had was the scroll wheel. It is extremely clicky - a bit difficult to press and fairly loud. This may not be a problem for everyone, so I don’t see a reason to take off a star for this or anything else for that matter. It’s a good mouse, just not for me.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on July 9, 2024",
        "Rating": "4.0 out of 5 stars",
        "Review": "Good mouse for casual gamers who don't need the highest level mouse for competitive gaming. The additional buttons on well placed and actuate nicely. Simply put, buy it if you like to game and have a life.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on February 7, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "I went from a G502 to the HyperX Pulsefire Haste. Wow, was that a mistake. I came running back to Logitech after exactly a year of dealing with HyperX and a constant bug that changed my DPI randomly.I palm/claw grip and have smaller hands, and the G502 felt a little bulky for me, so I wanted to try this before shelling out for the Pro. I love it and missed having working software. The shape finally gives my hand a good place to sit. It would be perfect it was a little lighter. I removed the stock skates (very easy to do) and added some X-ray Ruby pads. It definitely made a great difference to subside the weight a bit. I also paired this with the Pulsar Gaming Gears SUPERGRIP for the G703, and it's by far the best grip IMO. It's way easier to clean than the other grips that have deep indentations. And it just looks super clean/minimal. It's overall an excellent mouse, would purchase again.I only have one complaint. With half the battery life of the G502, it's very noticeable how much more often I have to charge it. I WFH and also game on my computer, so I'm using my mouse all day, every day, and I end up charging the mouse every 4-ish nights. That's not too bad, but it's worth noting for those used to the G502 battery.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on July 22, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "I recently got my hands on this gaming mouse, and it has been an excellent addition to my gaming setup. The mouse fits perfectly in my hand and is super ergonomic, making long gaming sessions comfortable and strain-free.The software is another highlight. It’s incredibly user-friendly and easy to navigate, allowing me to customize settings and buttons without any hassle.Overall, this gaming mouse combines ergonomic design with intuitive software, making it a fantastic choice for gamers seeking comfort and ease of use. Highly recommended!",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on September 9, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "Lifespan is limited only by the rubber which gets nasty after about 2 years. Otherwise, I love the mouse feel and action",
        "Sentiment Label": "Negative"
    },
    {
        "Date": "Reviewed in the United States on September 21, 2024",
        "Rating": "2.0 out of 5 stars",
        "Review": "The mouse it self fantastic, great battery life which can last days and sometimes a week on a full charge. Lots of customization via it's program along with macros and such.However, it's uses proprietary wires and goes out of it's way to make sure that any other standard wireless charging methods do not work for this mouse. The charging port in front is too small to fit a USB-C despite it looking like it could fit one so you need the cable it comes with and god forbid you have pets who decide to chew because Logitech doesn't provide or sell replacements (because they'd rather you buy a new mouse). There's the wireless option, which is a joke, because it only comes in the form of a 80$ mouse pad you need to plug in; which I feel misses the plot at this point and might as well buy a wired mouse. And this is probably the only time I give praise to products made by a certain country that starts with a C since they don't give a F about our proprietary patent BS and will happily fill in that market for them. So thank Pooh there are 3rd party options.So in summary: Again, the mouse is fantastic. I just hate it when companies resort to scummy tactics to try to get customers to buy their products again when something small goes wry. But if you MUST have this mouse know that there are 3rd party cables and chargers available so you won't be totally screwed when something goes wrong. Keep in mind this doesn't change the fact that you NEED to buy accessories made ONLY FOR THIS PRODUCT just for something as simple as charging the battery which is the main reason why stuff like this pisses me off.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on September 19, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "Muy buen producto",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on August 21, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "I have used this mouse for 6 years and never had a complaint. When one gets worned down to much I buy another one. I've had tried lots of other mice and this one has never lost the top spot for me.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on October 25, 2024",
        "Rating": "3.0 out of 5 stars",
        "Review": "Worked pretty well light duty for 2 years, now the left click button is going bad.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on December 16, 2023",
        "Rating": "3.0 out of 5 stars",
        "Review": "Update: I'm revising my rating to 3 stars because I was at least able to find a 3rd party replacement wheel and new mouse feet. So I was able to salvage it, but the 3rd party wheel (while very good) isn't quite perfect. Regardless, I shouldn't have had to spend time/money fixing it. There's no good reason I can see to design the wheel spindle the way it is. It is clearly a weak point.Lots of other reviews talk about what's great about this mouse, and generally I agree with most of that but I'll skip straight to the pertinent part of my review. It felt solid and like the best mouse I've ever owned...until it broke. I really liked this mouse, but it just broke in a really dumb way so I felt compelled to come leave this review. I know mice aren't usually made to last forever, but the specific way this one broke just feels unnecessary and easily preventable. I've had it almost exactly 3 years, and I do *not* abuse it. I play a lot of games on controller now anyway, so it has seen only light or moderate usage in that time. The scroll wheel especially saw only light usage (the part that broke). The tip of the little plastic spindle that is attached to the center of the wheel snapped off while I was *very* slowly scrolling a webpage, so now the mouse can't tell when you're spinning the wheel and scrolling does nothing. I am currently attempting to super glue it back together, but it's not going well haha. I've attached a photo with the part I'm talking about circled (after attempting to glue it back together).",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on August 26, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "I have been using Logitech mice for decades.  This is one of the best.  Easy to install.  Rechargeable battery lasts about a week between charging with daily use.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on April 6, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "During the pandemic I bought my first PC and switched from a lifetime controller player to a first time mouse and keyboard player. This Mouse made it through the entire lifespan of warzone 3 years to the day, but this past week one of the clickers is now malfunctioning. I'm sure a genius could fix it and keep using this mouse, I could buy a replacement, I'm not sure I would pay this much when the 502 has such good reviews still trying to figure out what I'm going to get. All I can say is switching to my backup Mouse feels like I'm playing with a cardboard box as a mouse compared to this g703. Battery life solid performance has been good. I hate that I have to replace it after 3 years but figure that's a lot of wear and tear",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on October 30, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review": "This mouse is much lighter, more responsive, and more precise than the 10-year-old Logitech it replaced. I mostly use it for work, and it's equally comfortable in my hand and easier on my wrist because it's so much lighter and easier to move. It doesn't have side scrolling, but I mapped the thumb buttons to scroll, and it works great. Also, clicking the scroll wheel enables scroll-based-on-offset mode which is great for scrolling (either vertically or horizontally) without needing to keep scrolling the wheel or pressing the button. Also, it's now much easier to drag things exactly one pixel for graphics work, which I didn't realize was previously frustrating until it started being easy with this mouse. Overall very useable for work.For gaming, this mouse is a huge step up. I mostly play StarCraft 2, and since getting the new mouse my accuracy is way better - I didn't realize how slow I had to move before to make sure I was clicking the right thing! It really feels like my hand suddenly got more coordinated. I don't do FPS much anymore, but I imagine it would make a big difference there too. Not a ton of buttons, so maybe not great for RPGs where you want to map a ton of things. But the core point-and-click experience is really great.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on December 12, 2022",
        "Rating": "4.0 out of 5 stars",
        "Review": "Originally when I got this product, I was upset because the product description sounded like it should have included a 10g weight and the mouse felt light.  I had taken all the items out of the packaging and did not see the weight.  Then I looked online and saw several answers that made it sound like you had to purchase the weight separately and it was not included.  A couple of the answers were marked as from Logitech so I presumed it was correct and wrote a scathing review.But I happened to think, \"no.  I've purchased many a Logitech product and this did not seem right.\"  I checked the packaging again and tucked into the place where the wireless dongle had been was the weight.  It must have been hidden under it and was well wedged into place.So if you're like me and you want that extra weight in your mouse, re-examine your packaging.  This weight does indeed come with the mouse and tucks nicely under the compartment under the mouse that's secured by a cover using a couple of magnets.Only time will tell if this product holds up but so far I've enjoyed it.  I do wish it had the button/feature for free mouse wheel scroll but it's holding up under limited use nicely.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on September 3, 2024",
        "Rating": "3.0 out of 5 stars",
        "Review": "I actually like this mouse when it's actually working 100%. But after a year both times I bought this mouse, the scroll wheel started to act up. I have to do remedies just for the scroll wheel to function correctly just to stop in a few hours.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on January 31, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "If you game a lot, you will constantly see recommendations for the lightest mice. The problem is, all of those mice are designed for small-to-medium sized hands. Makes sense! That's the biggest slice of the market, after all. But, for a lot of people, they are way to small. Your fingers will hand off the G Pro Wireless or the Razer Viper or any of the other light and superlight models on the market.The g703 is already quite light, and more importantly you need a mouse that will fit into your hand correctly. Hitting a few shots but giving yourself permanent damage from holding a tiny mouse for hours at a time is not a good tradeoff.Also, I would recommend looking into a dock for these - you can charge whenever you aren't using the mouse so that you never have to plug in the cord.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on July 1, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "I've tried many wireless and wired mice for both gaming and casual use. This mouse has met my needs for both better than any other mouse I have tried, even at a higher price point. Very nice balanced weight, sleek design, and easy to customize software. Battery life is outstanding, typically requiring a charge about once a week with daily use. If you are on the fence just try it out.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on August 17, 2024",
        "Rating": "3.0 out of 5 stars",
        "Review": "This mouse is the perfect shape, size, and feel. 3.5 years later has developed the infamous double click flaw with the left mouse button resulting in it being completely unreliable. 5 stars when it works but almost worthless now... so 3 stars it is. What a shame. Maybe one day they'll fix this. Until then I'll just keep buying them and throwing the old one in a bin.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on April 12, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review": "I tried my brother mouse and fell in love before that I originally had a razor mouse “never again” works fine then issues with sensor. Then I bought the Logitech mouse with the sniper button on the side.. oh how everyone who touches that mouse hates it… now for this mouse I used it pretty heavily I’d say over 500 hours so far if not more but my poor wife was given my Logitech mouse the sniper one and she had about enough of it and tossed it so I gave her my mouse I turned off the rgb and turned off the side buttons and she loves it. I then ordered me another one because if it ain’t broke don’t fix it. I hope it never goes away I have big hands my brother even bigger my wife smaller she’s 5’2” I’m 6’3” my brother is 6’9” fit is great for all of us the wireless mode is better then most mice wired mode I can’t tell the difference unlike other mice I’ve owned from wired to wireless battery life is fantastic I forget it even has to charge to be honest no strange issues or glitches it just works and it butter smooth. With its current defaults for speed I play on max 3 is what most will play on wife likes two and 1 is used for bios. 10/10",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on September 2, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "Muy buen mouse.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on February 13, 2024",
        "Rating": "3.0 out of 5 stars",
        "Review": "This mouse is perfect, but after going thru three of these over the years for the same reason, I can't anymore (my fault for trying 4 times).  All three of them had issues with the scroll wheel.  The first two I think were earlier versions but the scrollwheel would not register correctly and would go up instead of down severely while browsing or in game.  For the recent versions of the G703 the scrollwheel broke down and malfunctioned.  The third one within 2 years and the fourth one within 6 months (i'm in the middle of a warranty exchange since it's still eligible I really hope they honor it).  I've used this mouse for everyday use and maybe 3-4 hours of gaming every night but I really think the scroll wheel (running down/breakingdown) shouldn't be an issue.If it didn't have consistent scroll wheel issues I'd give this 5 stars because otherwise this is a very good mouse for gaming/wireless/everyday use.  I love everything else about it until you're met iwth a malfunctioned scroll wheel wearing out or just not going up and down accurately.",
        "Sentiment Label": "Negative"
    },
    {
        "Date": "Reviewed in the United States on July 11, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "My husband has big hands so finding a mouse that is comfortable has been a big challenge. This one works! It's oddly lighter than I expected even with the weight. So consider buying more weights to put in if you prefer something with a bit more heft.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on February 12, 2024",
        "Rating": "4.0 out of 5 stars",
        "Review": "I have been re-buying since its came out. Anytime its on sale I buy a new one. I have bought this mouse 4 times in total only thing that ended up happening with the mouse after about over a year of using it is the battery drains fast and on 1 of them It ended up double clicking. Might be from just playing a lot of shooters and League if legends where im clicking excessively",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on May 9, 2024",
        "Rating": "3.0 out of 5 stars",
        "Review": "This is a great mouse for gaming. The wireless works great and has good battery life. The overall shape is comfortable for a palm grip and the large M4 and M5 buttons are nice. I only rated this a 3 star simply because of the quality control of the mouse. I have had 3 of these mice go bad with the mouse wheel not scrolling properly after a short period of use (2-3 months). However, I have 2 of these mice that are working perfectly fine. One I have had since the mouse was released and a newer one that is about 4 months old now. It feels very hit-and-miss on the durability of these mice. When it works it's great! I would recommend this mouse, but I hesitate because the scroll wheel issue is pretty bad.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on July 23, 2021",
        "Rating": "5.0 out of 5 stars",
        "Review": "All I have ever bought are cheap office mouses, or inexpensive gaming mouses. I am glad to say I finally was able to change that. This was the upgrade I needed. I have been using this for about 2-3 months as of now. It's created a clear improvement in my gaming and everyday experience.In terms of gaming I mainly play fps. For the most part I am pretty good at them, expect for Valorant. Well, not any more. Sure I have spent some time training in the practice range, but I have to say I saw a significant difference in my performance when I switched mouses.Another game which has been impacted is TeamFight Tactics and League of legends. Although they are the polar opposite of a shooter the mouse has given me the right amount of precision. It was slight, but I used to have an issue where sometimes it felt like I was clicking a little bit away from where I wanted to click. This mouse has solved any precision issues I've had.The only flaw that I've really had with this mouse is the placement of the dpi- button. Maybe my hands are too big or I just move my hand around a lot, but sometimes I click it on accident without noticing. its not a huge issue and I notice it pretty quickly, but it had happened 4 or five times already.In terms of battery not many comments to add. It lasts a really really long time. I have it on and use it pretty much every day for about 6-7 hours and it keeps going for a long time. It usually lasts like two weeks before needing charge.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on July 16, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "This was a gift and it was a hit.  For the price, I can't imagine how it works so well.  It was perfect for a normal computer user who doesn't play video games.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on July 9, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "Functions great, I find myself accidentally hitting the 'back' button sometimes, and if the mouse is plugged in via cable, it won't charge unless the mouse is 'on'Otherwise no problems! Connection is always good with the dongle!",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on January 15, 2020",
        "Rating": "3.0 out of 5 stars",
        "Review": "First off, don't spend your money for this if you're not a serious gamer. You don't need the responsiveness, without the feel of a wire. This is a very good product at the end of the day, but you should understand it comes with a few cons. Let's get into it and tell you why this 3 star product is the best \"gaming\" mouse on the market (right handed only review).+ Design is simple and comfortable with your hands (layout). No awkward accidental hits die to weirdly placed buttons.+ Looks fantastic, and the RBG plays into the fun factor.+ Materials feel nice against your skin. Grippy, yet soft.+ Weight is excellent. I like using the heaviest 'coin' insert.+ Response time is as fast as the quickest wired mice. Enough said.+ Sensor accuracy is bar none the best. I've tried it all. This doesn't skip. I can't make it skip or stutter. This is rare, as I can make anything else skip pretty easily with flick type shots or 180 spins. Final Mouse, Rival, Sensei, all lack here.. Make sure you get the PMW3366 sensor, not the older SKU.+ Software is easy enough to use and configure to your specific wants. Full macro control.+ No cord snag, which is very nice for fast competitive gaming, especially FPS.+ Charge life is excellent, with or without RBG cycling.Now I know you're confused why 3 stars after all these glowing points. Read the second negative, and it's why this product isn't a 5/5 stars. To me, it's a big flaw.- Weighted coin insert not included in the newest sensor revision. I use mine from the old mouse, which broke. For a mouse so expensive... Really Logitech?- Mouse wheel is atrocious. It comes a little stiff that you can press down, and it won't scroll also. But the wheel gets \"broken in\" very quickly and then becomes an utter mess. Depending on what you use Mouse3 for, it can really impact you negatively. I've gone through many of these mice, and they are all the same. I press Mouse3 in (middle button) and it's a damn challenge to not scroll with it to. Want to use the scroll function? Try to go 1 tick, but it goes multiple because it's so loose and flimsy. This one button is the death of me. The best mouse on the market with a disastrous flaw. This mouse wheel is one of the worst I've had ever tested, which is strange. The best mouse wheel I've tested is still the old school Logitech G400s. I guess now days they try to save costs in something they think is over looked. Sad cause the rest of the mouse seems premium.",
        "Sentiment Label": "Negative"
    },
    {
        "Date": "Reviewed in the United States on March 4, 2023",
        "Rating": "4.0 out of 5 stars",
        "Review": "I really like this mouse, I have no issues with it other than the Logitech G software, which is slightly buggy and a bit annoying to work with but the mouse is really good. Battery life is decent even with the RGB on, I get 3-5 days/charge with heavily varying hours of use. I knocked off a star because the best implementation is to have a switch on the bottom for the RGB lighting in my opinion. But, that's my only issue with it. The best way to use a high DPI mouse is to crank up the DPI on the mouse and lower it far down in the games and stuff you're using. That way, you have a lot of precision. The Teflon feet slide around almost effortlessly on my mousepad, and it's also very quiet to move around. It can handle being mad and slammed on a bit, just mind the scrollwheel because that is a failure point if dropped.Overall, it's nicely weighted, and clicky.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on July 7, 2023",
        "Rating": "3.0 out of 5 stars",
        "Review": "Issues: This is my first time purchasing a Logitech product. I was thoroughly impressed with the mouse that I purchased. However, 6 months after using this mouse, the scroll wheel malfunctioned. At first, it wasn't that big of a deal, but it progressively became more irritating and frustrating because the scroll wheel wanted to work on its own time. Trying to scroll down would result in the page scrolling up SOMETIMES, or it just wouldn't work. Then there are also moments when the scroll wheel moves down on its own without me touching or using it. It became so annoying that I decided enough is enough and purchased a new mouse. If the scroll wheel hadn't malfunctioned, this would have been the best gaming mouse I have ever purchased. Unfortunately, I don't know if I'll ever purchase another Logitech mouse because of the issue with this scroll wheel.Pros:1. Exceptional for gaming2. Has weights on the mouse that you can adjust to your own liking3. Feels comfortable to hold/Isn't too big for people with smaller/medium-sized hands.4. The wireless battery life lasts for A WHILE (the longest it's lasted for me was 2 1/2 weeks)Cons:1. Scroll wheel decided to give out on me 6 months in.2. Adding on to the scroll wheel bit: Even when trying not to use the scroll wheel, it would work on its own and randomly scroll up or down without me touching it. So it affected gameplay a lot of the time.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on April 18, 2023",
        "Rating": "1.0 out of 5 stars",
        "Review": "I have had a logitech G710 keyboard now for a number of years, so when my old (cheap) mouse died, I replaced it with a reasonably high end logitech mouse. That was in fall of 2021. After just a year and a half of regular use, the scroll wheel has died. This is the third time now I feel Logitech has screwed me... It used to be they had quality products that lasted. When I updated my OS to Win10, they said \"We don't care if your saitek flight controls worked fine yesterday, now that we own them, we do not wish to continue supporting them, go buy a new set of our flight controls. Here are some (high end) recommendations at $300+\". Then I eventually had to replace my keyboard and got my G710. I have loved it since I got it (the only problems I have with the keyboard are that the letters on the keycaps are wearing out, and when they updated their software a while back, it seems to no longer recognize the keyboard, thus I can not reprogram the G-Keys (which are the only thing that really sets it apart from anyone elses keyboard) so I now have G-Keys that are permanently bound to macros for games I no longer play), BUT that lead me to pick up a mouse here from amazon and a headset from a local big box store. The headset hinge broke within a couple weeks, and the mouse only lasted a year and a half. I now can only believe that Logitech quality control has declined since I got my keyboard.The headset I returned to the box store for a refund.I use this mouse every day for work and gaming. It is comfortable to use, and has decent battery life (though other brands have up to twice the life). I did have trouble with the wireless not liking to be plugged directly into my laptop that I never figured out, but the dongle works on the charging cable so I was not overly concerned once I got it working. The RGB control software seems to occasionally forget my settings, but that is minor. And last but not least, not all my games like playing nice with the DPI switching, but at least they do not default to the low setting. Prior to the sudden failure of the scroll wheel I had been looking at getting the powerplay wireless charging mousepad to go with my mouse. I DID genuinely like my mouse, but it died much too soon, now I distrust the brand as the quality control seems to be declining.I can not recommend buy Logitech products for the foreseeable future. Perhaps at some point in the not too distant future I will take the mouse apart and see what actually broke. If it is just a plastic piece, I may be able to repair it, or even make a new housing for the electronics, but for now I am stuck looking to purchase a decent wireless mouse from a different brand.",
        "Sentiment Label": "Negative"
    },
    {
        "Date": "Reviewed in the United States on April 12, 2023",
        "Rating": "4.0 out of 5 stars",
        "Review": "The mouse is very comfortable and very responsive.  Pressing the button on top changes the speed of your mouse pointer.  This is a nice feature BUT, on my other Logitech mice, this button changes the mode of the scroll wheel from click to no click (Smooth), allowing me to scroll as fast as I can spin the wheel, which is more important to me than the speed of the mouse itself.The second thing I didn't like about this mouse is that it will not pair with my other Logitech receivers which allows me to switch devices and use the same mouse, this way I only need 1 mouse to operate multiple devices.  That's what I was hoping to do with this mouse.  No dice.Anyway, I'm sure it's great for gamers but if you're like me and you love the other functions, this mouse won't be for you.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on July 14, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "Good color options to match my KB. Smooth response. Nice weight... Simple and not overloaded with unnecessary flare or buttons.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on January 8, 2024",
        "Rating": "4.0 out of 5 stars",
        "Review": "Was a pretty good mouse. Not as light as I might like, outdated USB micro B charging port. Comfortable but not excellently so. Great value at $50 at time of purchase. After close to 4 years of use, the scroll wheel sensor snapped off while scrolling a webpage. It no longer clicks while turning and doesn't scroll anymore. RIP little guy.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on December 21, 2021",
        "Rating": "5.0 out of 5 stars",
        "Review": "I upgraded from my old Logitech G Pro gaming (wired) mouse and this mouse has been a fantastic upgrade.Everything feels better, the left & right clicks, the scroll wheel, everything just feels nicer to handle.I did notice a lot of people complaining of battery life, but have you ever thought of not running the RGB lighting? I noticed easily a week worth of PC time (30+ hours just on weekdays alone)The DPI adjustment is absolutely absurd, in a good way. I could never see myself using anything above 3,000 DPI but for those who need it, it is there!The charging cable is a nice texture that prevents cat hair from sticking to, unlike the braided cable on the G Pro gaming.Lastly, the wireless dongle is labeled (thank you!) as G703 which helps prevent mixups with the loads of other devices that have just the Logitech branding on them.All in all, this mouse is a fantastic deal! ($60) at the time of writing and I haven't noticed any clicking issues. I wish I could say the same about the \"refurbished\" unit I received that ended up being a non-lightspeed G703 (that also smelled like someone's house & had dirt all in the skates). And that particular unit had right click & scroll wheel issues. However, this new one does not!",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on June 30, 2024",
        "Rating": "3.0 out of 5 stars",
        "Review": "I have bought this mouse 4 times now all for the same reason! After maybe a month or two of usage, it always starts to double click out of nowhere and i am absolutely tired of it. I love this mouse because for one its wireless and also because of the shape it has, but it fails me everytime with these double clicks",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on October 26, 2021",
        "Rating": "4.0 out of 5 stars",
        "Review": "I didn't have any issues with my previous Logitech mouse which was the G303 Daedalus Apex but I like to remap the side buttons on the left side to volume up and down and doing that on my G303 was pretty easy and allowed me to have really fine control on my volume through those 2 buttons through some antique delay response where after holding the button for a few seconds it would switch from a small increment to a fast but familiar increment like you would on a tv remote. However, with this mouse you only have 2 settings, either setting it to a setting where it would raise the volume by extremely fast increments from one click or setting it to only go up 1 increment per click. This isn't a major issue so I wouldn't expect anyone other than me and like 2 other people in the world to have a problem but I just wished it had the finer control like it did with the G303. Other than that, the battery life is great, I go on my computer every single day for 8+ hours and I charge it once every 1-1.5 weeks. Feels great and is reactive.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on March 31, 2022",
        "Rating": "3.0 out of 5 stars",
        "Review": "This mouse has a lot of things going for it and a few key drawbacks, but first and foremost I need to get this said: the stock feet are HORRIBLE. I literally cannot bear to use this mouse with these feet. Very slow glide, a lot of resistance/friction, and inconsistent feel. I recommend replacing them right away with Corepads (which I bought, they're in shipping) or Superglides. Other than the feet, my big complaint with this mouse is, surprisingly, not the weight. It's the shape. This mouse is sneakily large and has an aggressive, prominent hump that is tough to distinguish in pictures. This mouse is definitely meant to cater towards the large-handed audience that I am not a part of.To exaggerate the uncomfortableness of the awkward hump and large size, this mouse weighs in at around the 100g mark, which is fairly heavy and makes the bad feet more noticeable. Even a G305 with a basic AA battery weighs a few grams less, which makes the G703 look bad when considering that it is a rechargeable mouse. Speaking of rechargeable, this mouse uses the archaic micro-USB port, but thankfully the port has enough space that your own cable can fit and you aren't forced to use the included one.The good parts of this mouse include the primary and side buttons, rubberized side grips, battery life, and easy performance adjustments using the Logitech Onboard Memory Manager. If you seek a large wireless gaming mouse with good performance and reliable connectivity, I encourage you to consider the Razer DeathAdder V2 Pro or Glorious Model D Wireless instead of the G703, as they are both far better mice in my opinion.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on February 10, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "It has the  hero sensor. I  have Cerebral palsy and my hands are not very steady. Once I set this mouse up and cranked up the DPI in the  logitech g hub program and  I play call of duty 200% better stabilized and better control now. I am so happy. I am still not number one. But I am at least on the board now and having a good time. This mouse is awesome and the lights are so pretty. Thanks Amazon.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on December 30, 2023",
        "Rating": "1.0 out of 5 stars",
        "Review": "Ah, the Logitech G703 Lightspeed Wireless Gaming Mouse—a device that seems to have time-traveled from the future, yet got tangled up in the past with its micro USB connection conundrum. Strap in for a humorous ride through the land of high-tech gaming meets a cable quagmire!Let's start with the design—sleek, futuristic, and as cool as an undercover spy. But then, *cue dramatic music,* enters the micro USB port! It's like discovering a cassette player in a Tesla. Why, Logitech, in this age of USB-C wonders, did you saddle us with this relic of the past? It's akin to a tech-savvy time traveler caught in a time loop, desperately searching for a USB-C portal.Now, the wireless capability—flawless, they say! But wait, the micro USB cable enters the scene again, sabotaging the wireless fantasy by demanding a recharge. It's like having a pet that refuses to run on batteries, demanding daily feeding through this tiny, ancient port. Cue the epic struggle of \"where did I put that micro USB cable this time?\"The Hero 25K Sensor—the superhero of precise gaming control! But alas, the micro USB cable whispers, \"I shall be the kryptonite to your gaming exploits.\" Just when you're aiming for that critical headshot, you're hit with the anxiety-inducing low battery notification. It's like the universe playing a prank on your gaming aspirations!Lightsync RGB—colorful, dazzling, and mood-enhancing! But hold on, the micro USB cable has something to say: \"I'll overshadow your rainbow of gaming delight with the dreaded chore of plugging and unplugging me for charging.\" It's like having a disco party that abruptly ends because someone unplugged the DJ booth.Rubber side grips—the comfort kings! But then, the micro USB cable whispers again, \"I shall be the sticky note reminding you of your wired past.\" Suddenly, you're reminded of the entanglements of yesteryear, a time when cords ruled the gaming world.In conclusion, the Logitech G703 Lightspeed Wireless Gaming Mouse is a marvel of gaming technology, held back by the ghost of micro USB past. It's like a rocket ship with a bicycle wheel attached—a brilliant creation undermined by an outdated appendage. So, if you're ready for a stellar gaming experience, just be prepared for the occasional time warp back to the era of micro USB inconveniences and a good laugh at this mouse's tech-relic quirkiness.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on October 22, 2023",
        "Rating": "3.0 out of 5 stars",
        "Review": "I did not get a USB dongle for wireless play nor did i get the lightspeed adapter. I do not know how this mouse plays but it feels nicely. I haven't used it on any games because i still use my wireless mouse for full range of motion and waited to open it. I feel ripped off. I opened the package about 30 minutes ago and all i received within the box was theiuse itself and a cord. I spent a few minutes examining the box to see if there were any hidden compartments to stash the adapter and dongle to avail. Unfortunately, I do not think I will ever use this mouse to game with. All i can say is to open your package as soon as you get it and check it's contents because I did not and now I'm down $80!!! I'd assume it's a good mouse because I've heard very good things about it and i know many people who use this mouse strictly for gaming.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on June 10, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "I game almost every night and i probably charge it like once a week. great mouse for gaming, sensitive",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on October 4, 2024",
        "Rating": "2.0 out of 5 stars",
        "Review": "Estuvo funcionando correctamente los primeros meses, no pasó ni 1 año desde que lo compre y la bateria ya no dura ni 1 dia con las luces rgb apagadas, es una lastima porque se espera que un raton inalambrico se pueda usar sin recargarlo por muchos dias, no se si el mio me vino fallado o si todos los ratones de este modelo son iguales, una lastima",
        "Sentiment Label": "Negative"
    },
    {
        "Date": "Reviewed in the United States on January 8, 2020",
        "Rating": "5.0 out of 5 stars",
        "Review": "Update: It's been 8 months since I've bought this mouse and I'm still loving it. No issues whatsoever. Will update if any problems arise.Original: First off, I want to mention that I have an average sized hand and use a palm grip on my mouse. I've had this for a little over a month now and I have to say that I love it. The battery life is great on this thing and I typically recharge it every 3 or 4 days (I usually turn it off if I'm not actively using my PC btw). I love the ergonomics on this thing and even more-so than the G502 that's so popular amongst Logitech fans; I even went to Bestbuy to test how the g502 felt in my hand, but I just didn't like the shape of it and it felt like my pinky and ring finger were dragging on the surface a bit too much for my liking, but with the g703 I don't have this issue. I've even gamed for 9 hours straight playing Resident Evil 2 and didn't feel any discomfort at any point using this mouse so needless to say, I'm quite pleased with the ergonomics. The rgb is customizable and simple to do with G Hub and so far I've had a good experience with the software so I can't complain on that front. I honestly don't really have a bad thing to say about this mouse, maybe it's cause I'm a newby and this is the first expensive mouse I've ever owned, but for a first mouse I think it's pretty great pick.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on July 4, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "Buy this for a while and it's stilling work great",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on January 11, 2024",
        "Rating": "3.0 out of 5 stars",
        "Review": "This was my first wireless mouse in years, and it was a good one. I came from a Razer Mamba (original) that I had used for 8ish years without ever having a problem. Still worked it was just time for an upgrade. This mouse was great initially, light-weight, and fit my large hands well, but ultimately died when suddenly after a year of use the scroll wheel broke and stopped working. Mechanical failure. A gaming mouse of this caliber only lasting a year is insanely wild to me, and I will not be purchasing Logitech mice for some time being, going back to Razer with the Deathadder v3 Pro.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on July 25, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "The video showcases the product in use.The video guides you through product setup.The video compares multiple products.The video shows the product being unpacked.Video Player is loading.Play VideoPlayMuteCurrent Time 0:00/Duration 0:08Loaded: 75.07%0:00Stream Type LIVESeek to live, currently behind liveLIVERemaining Time -0:08 1xPlayback RateChaptersChaptersDescriptionsdescriptions off, selectedCaptionscaptions off, selectedEnglish (Automated)Audio Trackdefault, selectedFullscreenThis is a modal window.\n\n\nVery good for fps games",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on October 15, 2019",
        "Rating": "5.0 out of 5 stars",
        "Review": "I upgraded the mouse from the older Logitech wired mouse (G502) since it finally started to breakdown after many years of use and also I wanted to be able to use the mouse wirelessly from a distance when I switched the input to the projector. This mouse, even from the next room (where my projector is set up), is on point every move, every click without any drop in connection so far.The RGB on the mouse is a joy to look at and it syncs up well with my Logitech G506 Lightsync speaker via Logitech G Hub software.I also love the fact that I have the option of switching between wired (via microUSB - data + charging) / wireless connection. I thought about getting a wireless charging mouse pad from Logitech so that I wouldn't have to worry about charging ever. I do really like the idea of that added convenience and the look of the product. However, I don't know if that justifies the ~$100+tax price tag (especially since Logitech wireless charging pad doesn't even have a USB port).Anyways, I'll give it some more time to see if it starts to fail on me but so far, I have not had any issue with it and I must say I do like the mouse itself. I needed a reliable high-performance low-latency wireless mouse for my new set up and Logitech 703 works perfectly fine for me!",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on October 24, 2024",
        "Rating": "2.0 out of 5 stars",
        "Review": "- the size is bigger than a typical medium size mouse- wheel is really loud- every time I touch side buttons it feels like it's oily or something because plastic for the side buttons and the body have very different feeling (shiny vs matte)",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on August 13, 2022",
        "Rating": "4.0 out of 5 stars",
        "Review": "Own both the original G703 w/3366 and this new ver w/Hero sensor. Difference are DPI increases from 12k to 16k max and longer battery life mostly. I heard debate that the 3366 is a better sensor, however, do not feel the difference on accuracy and latency. However, I also use MX Master when not gaming for its hyper-scroll wheel and overall more comfortable shape. Gaming wise there is no contest, as the G703 is simply more accurate, faster, and even mouse scrolling is noticeably smoother (tested and verified w/240Hz monitor). It has has weight that you can add optionally if one feels mouse is too light. There are RGB lights on wheel and logo (@palm area) which can be light sync and turn off if desired to save battery. Thank you for reading my review.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on June 24, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review": "I am satisfied with this mouse and the price I payed.Pros:-Responsive, glides easily on finished wood, doesn't jump around or respond sporadically.-RBG illumination is nice.-Scroll wheel is smooth, left and right clicks are moderately audible but this doesn't bother me.-Adjustments for mouse speed with button.-Not overloaded with buttons, two buttons accessed with thumb.-Can use when charging with cord (USB).-Rechargeable battery.Cons:-Okay, this mouse will not connect to Bluetooth directly, I was hoping it would. Must use the included receiver occupying one USB port sadly. Not a problem for me although I can see someone with limited USB ports such as a laptop not wanting to use one of their USB ports.-Must recharge periodically.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on July 18, 2023",
        "Rating": "4.0 out of 5 stars",
        "Review": "I love my G703, the feel and weight are perfect. However Logitech gimped the design by limiting it official to their Powerplay. The mouse works PERFECTLY with a third party Qi charger puck. For a $20 upcharge I get a great wireless mouse with super easy charging. DO NOT buy Powerplay, the 3rd party options work great and Logitech should be ashamed for not offer Qi charging since it already support it.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on August 27, 2019",
        "Rating": "5.0 out of 5 stars",
        "Review": "I'm a professional software developer and my use case for this mouse and the PowerPlay charging pad is a bit different than the usual gaming user's use case.As I design software all day, I need a reliable mouse with and want the most ergonomic and worry free experience possible.  For me, this means a medium weight mouse with no cord and not having to worry about charging.  Historically, I have used a Wacom tablet with a Wacom accessory mouse atop the Wacom tablet to achieve this \"wireless but never have to charge it\" effect.  Unfortunately, Wacom has stopped producing the mouse accessories.I have the G703 and the PowerPlay charging pad and it's incredible.  I run MacOS and use the Logitech G Hub software.  I've had no problems with this software and it's actually just as good at switching profiles for different development tools as it is at switching for different games.In my use, the mouse is always on the PowerPlay pad so I just never have to worry about charging.  The mouse is always ready to go and there are no compromises like a cord getting in the way.Some people have panned the G Hub software but I've actually found it to be fine.  It doesn't get in my way and it lets me set the things I want to set.  I'm very happy with this purchase.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on March 28, 2021",
        "Rating": "4.0 out of 5 stars",
        "Review": "I like everything about this mouse except one small thing. The coefficient of friction of the underside is a little low and any sloped surface of like 10-15 degrees or higher that doesn’t have its own high coefficient of friction will cause the mouse to slide down. This constantly happens to me on my laptop pad which are often designed with a slight slope to them. If I stop gaming to reply to a text I can bet the mouse is going to slide off and end up somewhere between my lap and oblivion. This is annoying because seemingly without fail the DPI setting button gets hit and the sensitivity gets changed. (I do love the DPI button for on the fly sensitivity changing and it’s not in a spot that should get hit should the mouse tumble, I’m just a special kind of unlucky).If you’re playing on a flat surface, the low coefficient of friction is probably a huge advantage. But for my purposes it is a hindrance, just keep that in mind when you buy.",
        "Sentiment Label": "Negative"
    },
    {
        "Date": "Reviewed in the United States on March 12, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "This Logitech G703 Lightspeed Wireless Gaming Mouse is nice. It works well and does what it claims. I've been using it for a few months now with no issues. The black and light-up design is very nice looking.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on October 26, 2022",
        "Rating": "2.0 out of 5 stars",
        "Review": "UPDATE 11/12/22: I've downgraded this mouse from 5 stars to 2. The mouse itself is PERFECT for me. However, recent update to the software has made it go to sleep way too often. When it \"wakes\", it operates at very slow cursor speeds, and takes a good 2-3 seconds for it to go back to the DPI/speed setting you've set it at. Why such a dramatic drop in stars for one simple thing? Because for me it messes up my work flow enough where it makes me consider another mouse, which is such a shame because it's all software related. I've even set the software to not automatically update, yet it still does so.I've owned a lot of mice over the years, all price brackets.This is by far my favorite. Aesthetically I love the fact that it isn't trying to stand out. It looks like how a mouse \"should\" look, plain and functional. However, it fits my hand like a glove. Of course this is subjective, as it may not fit your hand as well.I also love the weight of the mouse. It's not so airy and light that it makes you feel like you're holding a toy, but also not so heavy that it'll fatigue your wrist after a whole day of work (or gaming).Logitech software allows you to customize it to your liking (programmable keys and RGB).Battery lasts a long long time too. I'd plug it in overnight maybe once every 2 weeks not because it needs it, but I like to stay topped off. Plus is, if it does run out of battery, you can still use it while plugged in and charging.I use my equipment alot, and put it through all kinds of usage. It's never let me down once. Highly recommend this mouse.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on September 17, 2019",
        "Rating": "5.0 out of 5 stars",
        "Review": "So I tried a lot of the different wireless mouses available, and in my opinion this is the best. But it's not just the best wireless mouse, it's also the best mouse I've ever owned PERIOD. The ergonomics are near perfect, the RGB is great (although the light coming from the mouse wheel is rather dim), and the mouse is very light, which makes it great for gaming and general use combined. Works great both in wired and wireless mode, and there's no perceptible lag when used wireless. Battery life is superb, especially for such a light mouse, and can be extended further if you are willing to turn off the RGB. Software allows for easy configuration of the buttons and DPI sensitivity presets (by default the button below the scroll wheel cycles between four presets), and the RGB lighting, and includes Macro support. Software works well on both PC and Mac (I use the mouse with both). Really don't have any significant complaints except price (it's not a cheap mouse). Can't speak to the long-term durability of the mouse yet since I've only had it about a month, but I've been VERY happy with it so far.Tip: If you don't need wireless check out the cheaper G403 since it's basically identical but lacks the wireless capability. I use that model at work and it's also fantastic.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on December 16, 2020",
        "Rating": "4.0 out of 5 stars",
        "Review": "I bought his mouse I was looking for something specific this mouse works fine fits my hand fine but I only used if for 30 minutes or so. The mouse is light ergonomic and sleek.... but I am one of those people who hates when the scroll wheel clicks when you scroll I like the scroll free feature this mouse lacks it. The mouse wasn't bad mouse the lights were nice the sleek fit in my hand which is small and fits to my height I'm 5'1 I have a smaller hand not super small but is proportionate to my height I have trouble with bigger mouses this one was perfect in size if only it had the scroll free I would have kept it I have no complaints about the actual mouse design or the RGB it was nice the scroll free feature it lacked made a disappointment of me but C'est Le Vie or That's Life I love Logitech gear and I would recommend this mouse if you didn't care about the scroll wheel clicking like I care.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on February 21, 2024",
        "Rating": "3.0 out of 5 stars",
        "Review": "Everything on this mouse is really good except for the pointer speed control button right behind the scroll wheel.  It is so easy to bump and depress you will constantly be resetting your pointer speed.  Happens to me at least 30 times a day and is super frustrating.  Would also benefit from a free-fly wheel scroll button like the 503 models.",
        "Sentiment Label": "Negative"
    },
    {
        "Date": "Reviewed in the United States on June 12, 2023",
        "Rating": "4.0 out of 5 stars",
        "Review": "This is my favorite mouse and when mine broke I bought this one- the same one again. I already own the charging mouse pad so why not. The pointer click broke on my last mouse but this one is holding up better I think. I'll be sad if/when these eventually stop working or break but I've used this set up for years now and would want to get something similar again in the future.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on July 26, 2019",
        "Rating": "5.0 out of 5 stars",
        "Review": "Mouse shape/size is VERY personal and subjective, but I've found the G403/703 to be pretty much perfect for me.  I do add the extra optional 10g weight, because I like my mice a little bit heavier.I've previously used a G403 wireless, and a G703 (non hero).  The original G703 was *nearly* perfect, but the battery life really wasn't great.  At most I would get ~20 hours of use before it needed to be charged.  With the new Hero version I'm able to consistently get 30-35 hours, that's a pretty great improvement.Software note:I was previously using the older Logitech Gaming Software to control my G513 and G703 non-hero, but apparently the new G703 Hero isn't supported or detected by the older software, so I was forced to switch over to the newer Logitech GHub software.  Had some issues with lighting effects not working correctly at first when I switched the software.  I wound up having to completely uninstall both the old LGS and the Ghub software, restart, then do a clean install of the GHUB software and now everything is working great.About the only thing I could think to possibly improve this mouse would be some option physically see on the mouse itself what the remaining battery life is, maybe an LED indicator?",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on April 16, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review": "It didn't take long for me to fall in love in with this mouse. It feels good in my hand, the clicks are nice, and I really love the side buttons. They were a big deciding factor for me purchasing this mouse and it was worth it. One recommendation is to get grip tape, it already has great grip but it's just if you want to protect the side material. That is my only complaint about the mouse. I've only been using it for a short amount of time and the rubber material already show signs of deteriorating, so I went and ordered grip take to at least try to protect it.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on May 7, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "Esta perfecto estoy completamente satisfecho con mi compra",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on April 30, 2022",
        "Rating": "4.0 out of 5 stars",
        "Review": "Changed from a 1 star to a four starThey have fixed the software issuesThe mouse is great when the software controlling it works. I have found that the Logitech hub software randomly resets, many times while in use. This not only changes the not so important rgb settings to default color fade, but any speed and sensitivity settings you have made disappear, often times in the middle of the game. Why go through the effort of buying a gaming mouse so you can customize settings when they repeatedly reset at often times very inappropriate and inconvenient times?  Hindsight being 20/20 I wouldn’t take another of these if it was free.They fixed the software issues",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on April 4, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "Right weight, right shape, great battery life. Comes with the weight to make it a tad heavier if it's too light for you.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on November 15, 2023",
        "Rating": "4.0 out of 5 stars",
        "Review": "support has helped - seems to be working now (I had to download a \"hub\")",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on October 20, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review": "Great mouse.  I have medium hands with an open grip.  No noticeable latency while gaming.  I pound the heck out of my buttons when I'm fragging and I've noticed no problems with my buttons wearing or giving out.  Super light and the battery is strong.  I tend to plug it in at the end of the day, but I have gone a couple of days without charging no problem.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on October 19, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review": "When I first bought the superlight, I was suprised by the lightness. Response is perfect, fast and overall comfortable for my hand. I forgot to charge it after a week of use and it still hasn’t died lol. It’s awesome and definitely worth it if it’s in your budget.Edit: it’s Oct 28, 2024, 2 years with this mouse and it hasn’t let me down. Daily use as well, have over 5k hours on r6 with this mouse, a bunch on mc and others. Sad that a new one already came out, maybe I’ll upgrade later on but this is very nice. Btw aftermarket sliders and grip is a to go, don’t be lazy and clean it every now and then.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on July 19, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review": "This design is by far more comfortable than a gpro wireless and they have the exact same specs. It curves in as it goes toward the end of the mouse and has larger thumb buttons on the side. My partner even said he prefers this design and he is the owner of a gpro.Also it’s got a dpi button under the scroll wheel that has a light in the wheel!Lastly the added weight is a huge benefit for me but is super light without it if that’s what you’re looking for!",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on July 21, 2021",
        "Rating": "4.0 out of 5 stars",
        "Review": "This mouse is pretty nice. It has a good feel and you can opt to not add the weight which makes the mouse lighter. The LEDs are neat but I only use the one on the wheel, otherwise it's too distracting. The USB dongle has to be very, very close mouse which is very strange. Their normal mice work from very long distances, but at least you can use the cord for the dongle to also charge the mouse.My biggest complaint is their G Hub software which is just sad. It's unintuitive and does weird things. It doesn't define things so there's a lot of trial and error. It takes a while to kick in when you move the mouse to change the DPI to what you set which is dumb. The software is just cheesy and very un-Mac-like.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on December 28, 2022",
        "Rating": "4.0 out of 5 stars",
        "Review": "Initially the skates chipped and started catching on the mousepad so i replaced them. A couple months later the mousewheel stopped working. Other than that i did like the shape of the mouse.  The mouse lasted me a little over a year about 14 months.  If the skates and mouse wheel were more durable i would give it 5 stars. Also why do companies always have to have theyre own unique cable. Why not have a USB type C.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on October 29, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review": "I have been using my razer deathadder V1 for about 6 years. I loved that mouse to death but i wanted a wireless mouse. I purchased this mouse in Feb 2023 and ive been using it everyday since! The mouse has great battery life, perfect fit for my palm and works well with my other logitech products! I purchased another mouse for my cousin and he loves it too.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on April 28, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "10/10 woul recommend for apex players.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on June 20, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "The media could not be loaded.\n                \n\n\n\nMuy cómodo",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on February 24, 2021",
        "Rating": "5.0 out of 5 stars",
        "Review": "I had an MX518 for so long that I don't even remember when/where I got it, it still worked, but I decided to replace it because it was generating an annoying high-pitched noise.I didn't want to initially go with a wireless mouse or a mouse this expensive, but it certainly is a nice replacement for the MX518; in comparison, the ergonomics feel good, the button layout is similarly positioned, and the weight is comparable. One of the best selling points for me is the ability to keep it wired, keeping it tethered doesn't add any additional drag that you're not already accustomed to with a wired mouse and it prevents my toddler from thinking he can walk off with it.I removed the old Logitech Gaming software and installed the \"G\" software for the G703 and was able to quickly setup the DPI setting similarly to the MX518 to get the same feel.Can't go wrong with the G703 as a replacement for the MX518.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on March 11, 2022",
        "Rating": "4.0 out of 5 stars",
        "Review": "For the current price, this mouse is a steal if you don't mind the weight. This thing weighs in at around 92 grams if you use it without the plastic pluck at the bottom of the mouse. The stock feet are not up to par, I replaced them with corepads. Other than that it's a good wireless mouse with nice clicks. My only gripe is that after a week there are marks on the side grip that indicates signs of wear, so I feel like this mouse isn't going to last as long since it looks like the area where I place my thumb is wearing down,",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on April 28, 2021",
        "Rating": "5.0 out of 5 stars",
        "Review": "A lot of improvements aren’t super obvious until you have to go back and use the old version and then all of the quality of life improvements you’ve gotten used to seem like necessities now and you wonder how you ever lived without them before.This was not that for me.I had previously been using a dell mouse that was included with a laptop a friend of mine bought circa 2009 and I only upgraded because my old mouse broke. The moment I touched this mouse I new gaming would never be the same. For anyone that is still using the cheap peripherals that came with your computer or the Walmart special you picked up for $9.99, just buy a new proper gaming mouse. It’s worth the money more than just about anything else in your set up and Logitech provides a great product here. I love this product so much I even started taking it work.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on March 23, 2022",
        "Rating": "5.0 out of 5 stars",
        "Review": "I am a 120 kg man. I am not a small guy, so is my hand. I think this mouse is not for everyone, especially for tiny people. I had a Roccat Lua before this one. It was OK, but it was smaller, so there was a gap between the hand and the mouse. Now there is no gap. The hand holds firmly the mouse. The wheel is very quiet. I used the provided weight to increase mouse's weight. I really like bigger and heavy tools. The battery seems to be enough for about a week, depending how much you work. I am a designer, so i use it a lot.Everything seems OK for the moment. Will update alter if I find anything new.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on December 15, 2021",
        "Rating": "3.0 out of 5 stars",
        "Review": "I also have a normal, non gaming mouse and you replace the batteries once a year. When it's time to go to bed, you shut down and go to sleep. With this, you need to put the cord in before leaving or you will be using it with the wire soon. A charge will last a few days, but, I don't want to keep changing it, I bought a wireless for a reason, so I don't need a wire... Also, the dongle will not work for my keyboard so I still need 2 USB ports, my computer only has 4, so I needed to buy a hub to use both, and I am constantly switching the dongle out to charge the mouse. The Ghub software required to make use of the features is not compatible with my OS so I had to install a hacked version. The Pinky side of the mouse is slopped so you don't get a good grip on that side. As for the DPI, the whole reason I got this, it is great! I finally get the speed I want without skipping pixels, but, with all the other hassle, I can't score this mouse as high as I wanted to.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on March 21, 2023",
        "Rating": "3.0 out of 5 stars",
        "Review": "The product worked fine with no issues for about 9 months. The mouse felt nice and is very customizable with the driver it comes with. However, after 9 months the left click started acting up, and now I've needed to use another mouse because of its effect on my gaming. When I hold down the left click button, the input doesn't seem to maintain itself pressed, because when I shoot a gun in games such as Overwatch or Valorant, the gun sometimes shoots in bursts even if it's fully automatic. I promise I am holding down the left click just fine, and I didn't have this problem for the first 9 months. Unfortunately, I can no longer refund this mouse, so I figured I'd at least write a warning. It may not affect all of them, but it sure did happen to me without any sort of damage to the mouse itself.",
        "Sentiment Label": "Neutral"
    },
    {
        "Date": "Reviewed in the United States on August 1, 2020",
        "Rating": "5.0 out of 5 stars",
        "Review": "Usually I don't update my product reviews but in this ocassion I would like to do it since I really appreciate the comfort and ergonomy of this mouse. The sensitivity is adjustable, the hand feeling is so soft and without a heavy sensation, just the correct quantity of useful buttons and the material is not at all a bad quality rubber that may be with the time could be have a sticky feeling, this mouse has a great quality rubber in the laterals, the wireless connection is stablished, in rare ocassions I could see a lag to recognize the mouse but in few seconds is recovered again, even though if you don't want any possible lag (again this has happen to me just 3 times in the last 8 months) you can use the usb cable and you'll have a wired connection without problems. The charging is very quick and the battery life, now that I use it everyday working from home, after 2 weeks need to charge while is charging I can use it with the usb cable. Really I love this product, highly recommended.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on December 13, 2023",
        "Rating": "5.0 out of 5 stars",
        "Review": "Ive been using this mouse for 2 years now and i love it, the shape, the size, the weight everything about it is exactly what i want from a mouse. I used a deathadder for years and this just feels like the perfect progression",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on March 3, 2024",
        "Rating": "5.0 out of 5 stars",
        "Review": "This mouse has been nothing but amazing. The battery life is incredible and there is zero input lag. I would highly recommend this product.",
        "Sentiment Label": "Positive"
    },
    {
        "Date": "Reviewed in the United States on April 29, 2024",
        "Rating": "3.0 out of 5 stars",
        "Review": "Decent Mouse, Terrible Battery Life",
        "Sentiment Label": "Positive"
    }
]